#include <stdio.h>

/*
	题目描述
	一只兔子藏身于20个圆形排列的洞中（洞从1开始编号），一只狼从x号洞开始找,下次隔一个
	洞找(及在x＋2号洞找)，在下次个两个洞找(及在x＋5号洞找)，它找了n次仍然没有找到。问
	兔子可能在那些洞中。
	
	输入描述:
	输入有多组数据，每组数据一行两个整数分别为x和n(x <= 20,n <= 100000)
	
	输出描述:
	每组数据一行按从小到大的顺序输出兔子可能在的洞，数字之间用空格隔开。若每个洞都不
	肯能藏着兔子，输出-1。
*/

void findRabbit(int x, int n){
	//f数组存储寻找过的洞 
	int i, isr = 0, f[20] = {0};
	//第一次查找，标记x洞 
	f[x - 1] = 1;
	//遍历之后寻找 
	for(i = 1; i < n; i++){
		//当前寻找的洞口
		x = (x + (i + 1)) % 20;
		if(x == 0){
			//整除时表示为第20号洞
			x = 20; 
		}
		//标记 
		f[x - 1] = 1; 
	}
	for(i = 0; i < 20; i++){
		//此洞未被寻找过 
		if(f[i] != 1){
			isr = 1; 
			printf("%d ", i + 1);
		}
	}
	//遍历完毕没有未找过的洞口 
	if(isr == 0){
		printf("-1"); 
	}
	printf("\n");
}

int main() {
	int x, n;
	while(scanf("%d %d", &x, &n) != EOF){
		findRabbit(x, n);
	}
}
